# Heroes Of Pymoli Report

### Importing Modules

In [1]:
import pandas as pd
import os

### Reading in Data Files

In [2]:
#path to the data file
file_url = os.path.join('Data','purchase_data_1.json')

#reading the json file into as a DataFrame
user_data_df = pd.read_json(file_url)

### Display DataFrame

In [3]:
user_data_df.head()

   Age Gender  Item ID                 Item Name  Price          SN
0   20   Male       93  Apocalyptic Battlescythe   4.49     Iloni35
1   21   Male       12                     Dawne   3.36   Aidaira26
2   17   Male        5                Putrid Fan   2.63      Irim47
3   17   Male      123         Twilight's Carver   2.55     Irith83
4   22   Male      154              Feral Katana   4.11  Philodil43

## Data Cleaning

### Check if all columns are equal: Pass

In [4]:
user_data_df.count()

Age          78
Gender       78
Item ID      78
Item Name    78
Price        78
SN           78
dtype: int64

### Drop empty rows and check the column count again

In [5]:
user_data_df = user_data_df.dropna(how='any')

user_data_df.count()

Age          78
Gender       78
Item ID      78
Item Name    78
Price        78
SN           78
dtype: int64

### Change the column name

In [6]:
user_data_df = user_data_df.rename(columns={'SN':"Username"})

### Display the DataFrame after Data Cleaning

In [7]:
user_data_df.head()

   Age Gender  Item ID                 Item Name  Price    Username
0   20   Male       93  Apocalyptic Battlescythe   4.49     Iloni35
1   21   Male       12                     Dawne   3.36   Aidaira26
2   17   Male        5                Putrid Fan   2.63      Irim47
3   17   Male      123         Twilight's Carver   2.55     Irith83
4   22   Male      154              Feral Katana   4.11  Philodil43

## Analysis

* Player Count
* Purchasing Analysis (Total)
* Gender Demographics
* Purchasing Analysis (Gender)
* Age Demographics
* Top Spenders
* Most Popular Items
* Most Profitable Items

### Player Count

In [8]:
player_count = len(user_data_df['Username'].unique())
print("Number of Players: {}".format(player_count))

Number of Players: 74

### Purchasing Analysis
* Number of Unique Items
* Average Purchase Price
* Total Number of Purchases
* Total Revenue

In [9]:
unique_items = len(user_data_df['Item ID'].unique())
avg_price = user_data_df['Price'].mean()
total_no_of_purchases = user_data_df['Price'].count()
total_revenue = user_data_df['Price'].sum()

purchasing_analysis_df = pd.DataFrame({
    "Number of Unique Items": unique_items,
    "Average Purchase Price": avg_price,
    "Total Number of Purchases": total_no_of_purchases,
    "Total Revenue": total_revenue,
},index = [0])

# data mugging 
purchasing_analysis_df['Average Purchase Price'] = purchasing_analysis_df['Average Purchase Price'].map("$ {:,.2f}".format)
purchasing_analysis_df['Total Revenue'] = purchasing_analysis_df['Total Revenue'].map("$ {:,.2f}".format)

purchasing_analysis_df

,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,64,$ 2.92,78,$ 228.10

### Gender Demographics
* Percentage and Count of Male Players
* Percentage and Count of Female Players
* Percentage and Count of Other / Non-Disclosed

In [10]:
player_demographics = user_data_df[['Gender','Age','Username']]
player_demographics = player_demographics.drop_duplicates()

total_count = player_demographics['Gender'].value_counts()
percentage = round(total_count/player_count * 100,2)

gender_demographics_df = pd.DataFrame({
    "Total Count": total_count,
    "Total Percentage": percentage
})

gender_demographics_df['Total Percentage'] = gender_demographics_df['Total Percentage'].map("{:,.2f}%".format)

gender_demographics_df

                       Total Count Total Percentage
Male                            60           81.08%
Female                          13           17.57%
Other / Non-Disclosed            1            1.35%

### Purchasing Analysis (Gender)

`The below each broken by gender`
* Purchase Count
* Average Purchase Price
* Total Purchase Value
* Normalized Totals

In [11]:
purchase_count = user_data_df.groupby('Gender').count()['Price']
avg_purchase_price = user_data_df.groupby('Gender').mean()['Price']
total_purchase_value = user_data_df.groupby('Gender').sum()['Price']
normalized_total = user_data_df.groupby('Gender').sum()['Price'] / gender_demographics_df['Total Count']

pa = pd.DataFrame({
    "Purchase Count": purchase_count,
    "Average Purchase Price": avg_purchase_price,
    "Total Purchase Value": total_purchase_value,
    "Normalized Totals": normalized_total
})

pa['Average Purchase Price'] = pa['Average Purchase Price'].map("$ {:,.2f}".format)
pa["Total Purchase Value"] = pa["Total Purchase Value"].map("$ {:,.2f}".format)
pa["Normalized Totals"] = pa["Normalized Totals"].map("$ {:,.2f}".format)

pa

,Purchase Count,Average Purchase Price,Total Purchase Value,Normalized Totals
Gender,,,,
Female,13,$ 3.18,$ 41.38,$ 3.18
Male,64,$ 2.88,$ 184.60,$ 3.08
Other / Non-Disclosed,1,$ 2.12,$ 2.12,$ 2.12

### Age Demographics
* Percentage and Count by each age range

In [12]:
labels = ['<10','10-14','15-19','20-24','25-29','30-34','35-39','40+']
bins = [0,10,15,20,25,30,35,40,100]

binned = pd.cut(player_demographics['Age'],bins=bins,labels=labels,right=False)
player_demographics['Age Range'] = binned

total_count = player_demographics['Age Range'].value_counts()
percentage = round(total_count/player_count * 100,2)

ad = pd.DataFrame({
    "Total Count": total_count,
    "Total Percentage": percentage
})

ad['Total Percentage'] = ad['Total Percentage'].map("{:,.2f}%".format)

ad

       Total Count Total Percentage
20-24           34           45.95%
15-19           11           14.86%
25-29            8           10.81%
35-39            6            8.11%
30-34            6            8.11%
<10              5            6.76%
10-14            3            4.05%
40+              1            1.35%

### Age Demographics

`The below each broken into bins of 4 years (i.e. <10, 10-14, 15-19, etc.)`
* Purchase Count
* Average Purchase Price
* Total Purchase Value
* Normalized Totals

In [13]:
labels = ['<10','10-14','15-19','20-24','25-29','30-34','35-39','40+']
bins = [0,10,15,20,25,30,35,40,100]

binned = pd.cut(user_data_df['Age'],bins=bins,labels=labels,right=False)
user_data_df['Age Range'] = binned

purchase_count = user_data_df.groupby('Age Range').count()['Price']
avg_purchase_price = user_data_df.groupby('Age Range').mean()['Price']
total_purchase_value = user_data_df.groupby('Age Range').sum()['Price']
normalized_totals = total_purchase_value /ad['Total Count']

age_demographics_df = pd.DataFrame({
    "Purchase Count": purchase_count,
    "Average Purchase Price": avg_purchase_price,
    "Total Purchase Value": total_purchase_value,
    "Normalized Total":normalized_totals
})

age_demographics_df["Average Purchase Price"] = age_demographics_df["Average Purchase Price"].map("$ {:,.2f}".format)
age_demographics_df["Total Purchase Value"] = age_demographics_df["Total Purchase Value"].map("$ {:,.2f}".format)
age_demographics_df['Normalized Total'] = age_demographics_df['Normalized Total'].map("$ {:,.2f}".format)
age_demographics_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Normalized Total
10-14,3,$ 2.99,$ 8.96,$ 2.99
15-19,11,$ 2.76,$ 30.41,$ 2.76
20-24,36,$ 3.02,$ 108.89,$ 3.20
25-29,9,$ 2.90,$ 26.11,$ 3.26
30-34,7,$ 1.98,$ 13.89,$ 2.31
35-39,6,$ 3.56,$ 21.37,$ 3.56
40+,1,$ 4.65,$ 4.65,$ 4.65
<10,5,$ 2.76,$ 13.82,$ 2.76

### Top Spenders
`Identify the the top 5 spenders in the game by total purchase value, then list (in a table):`
* Username
* Purchase Count
* Average Purchase Price
* Total Purchase Value

In [14]:
purchase_count_tp = user_data_df.groupby('Username').count()['Price']
avg_purchase_price_tp = user_data_df.groupby('Username').mean()['Price']
total_purchase_value_tp = user_data_df.groupby('Username').sum()['Price']

top_spender_df = pd.DataFrame({
    "Purchase Count": purchase_count_tp,
    "Average Purchase Price": avg_purchase_price_tp,
    "Total Purchase Value":total_purchase_value_tp
})

top_spender_df['Average Purchase Price'] = top_spender_df['Average Purchase Price'].map("$ {:,.2f}".format)
top_spender_df['Total Purchase Value'] = top_spender_df['Total Purchase Value'].map("$ {:,.2f}".format)

top_spender_df = top_spender_df.sort_values(['Total Purchase Value'],ascending=False)
top_spender_df.head()

            Purchase Count Average Purchase Price Total Purchase Value
Username
Sundaky74                2                 $ 3.71               $ 7.41
Aidaira26                2                 $ 2.56               $ 5.13
Eusty71                  1                 $ 4.81               $ 4.81
Chanirra64               1                 $ 4.78               $ 4.78
Alarap40                 1                 $ 4.71               $ 4.71

### Most Popular Items

`Identify the 5 most popular items by purchase count, then list (in a table):`
* Item ID
* Item Name
* Purchase Count
* Item Price
* Total Purchase Value

In [15]:
item_data = user_data_df

purchase_count= item_data.groupby(['Item ID','Item Name']).count()['Price']
avg_purchase_price = item_data.groupby(['Item ID','Item Name']).mean()['Price']
total_purchase_value = item_data.groupby(['Item ID','Item Name']).sum()['Price']

top_item_df = pd.DataFrame({
    "Purchase Count": purchase_count,
    "Average Purchase Price": avg_purchase_price,
    "Total Purchase Value":total_purchase_value
})

top_item_df['Average Purchase Price'] = top_item_df['Average Purchase Price'].map("$ {:,.2f}".format)
top_item_df['Total Purchase Value'] = top_item_df['Total Purchase Value'].map("$ {:,.2f}".format)

top_item_df = top_item_df.sort_values(['Purchase Count'],ascending=False)
top_item_df.head()

,,Purchase Count,Average Purchase Price,Total Purchase Value
Item ID,Item Name,,,
94,Mourning Blade,3,$ 3.64,$ 10.92
90,Betrayer,2,$ 4.12,$ 8.24
111,Misery's End,2,$ 1.79,$ 3.58
64,Fusion Pummel,2,$ 2.42,$ 4.84
154,Feral Katana,2,$ 4.11,$ 8.22

### Most Profitable Items

`Identify the 5 most profitable items by total purchase value, then list (in a table):`
- Item ID
- Item Name
- Purchase Count
- Item Price
- Total Purchase Value

In [16]:
top_item_df = top_item_df.sort_values(['Total Purchase Value'],ascending=False)
top_item_df.head()

,,Purchase Count,Average Purchase Price,Total Purchase Value
Item ID,Item Name,,,
117,"Heartstriker, Legacy of the Light",2,$ 4.71,$ 9.42
93,Apocalyptic Battlescythe,2,$ 4.49,$ 8.98
90,Betrayer,2,$ 4.12,$ 8.24
154,Feral Katana,2,$ 4.11,$ 8.22
180,Stormcaller,2,$ 2.77,$ 5.54